// Задание 3
// 3.* Подумать над глобальными сущностями. К примеру, сущность «Продукт» в интернет-магазине актуальна не только для корзины, но и для каталога. Стремиться нужно к тому, чтобы объект «Продукт» имел единую структуру для различных модулей сайта, но в разных местах давал возможность вызывать разные методы.

// ООП. Наследование и полиморфизм.
// Можно создать абстракный базовый класс (Продукт, например), определить методы, которые будут доступны для всех потомков.
// Создать классы потомков (Корзина, Каталог и т.д.). Определить методы, уникальные для каждого подкласса. При необходимости переопределить методы базового класса.
